# Pandas

pandas is a Python package providing fast, flexible, and expressive data structures designed to make working with
“relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python.


## Pandas DataStructures

- Series 
- DataFrame
- Panel

### Series
Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers,
Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is
to call:
>>> s = pd.Series(data, index=index)

A series can be created using various inputs like −

- List
- Dict
- constant

In [3]:
import pandas as pd
data = ['Anil','Basanti','Charan','Dolly']
s=pd.Series(data)
print(s)

0       Anil
1    Basanti
2     Charan
3      Dolly
dtype: object

In [4]:
s=pd.Series(data, index=['Row1','Row2','Row3','Row4'])
s

Row1       Anil
Row2    Basanti
Row3     Charan
Row4      Dolly
dtype: object

In [5]:
data = {
    'Row1':'Anil',
    'Row2':'Basanti',
    'Row3':'Charan',
    'Row4':'Dolly'
}
s=pd.Series(data)
s

Row1       Anil
Row2    Basanti
Row3     Charan
Row4      Dolly
dtype: object

In [6]:
s=pd.Series(data, index=['Row3','Row2','Row4','Row1'])
s

Row3     Charan
Row2    Basanti
Row4      Dolly
Row1       Anil
dtype: object

In [8]:
s=pd.Series(5, index=['Row1','Row2','Row3','Row4','Row5'])
s

Row1    5
Row2    5
Row3    5
Row4    5
Row5    5
dtype: int64

#### Accessing series data using position

In [14]:
data = ['Anil','Basanti','Charan','Dolly']
s=pd.Series(data)
print(s)

0       Anil
1    Basanti
2     Charan
3      Dolly
dtype: object

In [9]:
s[0]

5

In [10]:
s[4]

5

In [11]:
s[[1,4]]

Row2    5
Row5    5
dtype: int64

In [12]:
s[0:3]

Row1    5
Row2    5
Row3    5
dtype: int64

#### Accessing series data using label

In [15]:
data = ['Anil','Basanti','Charan','Dolly']
s=pd.Series(data,index=['Row1','Row2','Row3','Row4'])
print(s)

Row1       Anil
Row2    Basanti
Row3     Charan
Row4      Dolly
dtype: object

In [16]:
s['Row2']

'Basanti'

In [17]:
s[['Row1','Row3']]

Row1      Anil
Row3    Charan
dtype: object


### What is DataFrame?

  A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

### Features of DataFrame
  - Potentially columns are of different types
  - Size – Mutable
  - Labeled axes (rows and columns)
  - Can Perform Arithmetic operations on rows and columns
  
  
#### Creating a Pandas DataFrame

  
  Pandas DataFrame can be created from various types of data such as
  
  - Lists
  - List of Lists
  - Dictionary
  - List of Dictionary
  - Dict of Series
  - CSV File
  - Excel File
  
##### Creating a dataframe using List: 

  DataFrame can be created using a single list or a list of lists.

In [18]:
import pandas as pd

lst = ['Anil','Basanti','Charan','Dolly']

df = pd.DataFrame(lst)
print(df)

         0
0     Anil
1  Basanti
2   Charan
3    Dolly

In [19]:
import pandas as pd

lst = ['Anil','Basanti','Charan','Dolly']

df = pd.DataFrame(lst, columns=['StudentName'])
print(df)

  StudentName
0        Anil
1     Basanti
2      Charan
3       Dolly

In [39]:
import pandas as pd

lst = ['Anil','Basanti','Charan','Dolly']

df = pd.DataFrame(lst, columns=['StudentName'], index=['Row1','Row2','Row3','Row4'])
print(df)

     StudentName
Row1        Anil
Row2     Basanti
Row3      Charan
Row4       Dolly

Index(['Row1', 'Row2', 'Row3', 'Row4'], dtype='object')

### Creating DataFrame using list of lists

In [23]:
import pandas as pd

lst = [['Anil', 98],['Basanti',80],['Charan',99],['Dolly',100]]

df = pd.DataFrame(lst, columns=['StudentName','Marks'])
print(df)

  StudentName  Marks
0        Anil     98
1     Basanti     80
2      Charan     99
3       Dolly    100

### Create a DataFrame from Dict of ndarrays / Lists
  All the ndarrays must be of same length. If index is passed, then the length of the index should equal to the length of the arrays.
If no index is passed, then by default, index will be range(n), where n is the array length.

In [24]:
import pandas as pd
data = {
        'studentName':['Anil','Basanti','Charan','Dolly'],
        'Marks':[98,80,90,100]
       }
df = pd.DataFrame(data)
df

  studentName  Marks
0        Anil     98
1     Basanti     80
2      Charan     90
3       Dolly    100

### Creating DataFrame using List of Dictionary

In [25]:
import pandas as pd

lst = [
        {'Marks':98,'StudentName':'Anil'},
        {'StudentName':'Basanti','Marks':80},
        {'Marks':90,'StudentName':'Charan'},
        {'Marks':100,'StudentName':'Dolly'}
      ]

df = pd.DataFrame(lst)
print(df)

   Marks StudentName
0     98        Anil
1     80     Basanti
2     90      Charan
3    100       Dolly

### Creating DataFrame using Dict of Series

In [26]:
import pandas as pd

data = {
    'StudentName':pd.Series(['Anil','Basanti','Charan','Dolly']),
    'Marks':pd.Series([98,80,90,100])
       }
df=pd.DataFrame(data)
df

  StudentName  Marks
0        Anil     98
1     Basanti     80
2      Charan     90
3       Dolly    100

### creating a DataFrame from CSV file

In [27]:
import pandas as pd
df = pd.read_csv(r"nba.csv")
print(df)

                        Name                    Team  Number Position   Age  \
0              Avery Bradley          Boston Celtics     0.0       PG  25.0
1                Jae Crowder          Boston Celtics    99.0       SF  25.0
2               John Holland          Boston Celtics    30.0       SG  27.0
3                R.J. Hunter          Boston Celtics    28.0       SG  22.0
4              Jonas Jerebko          Boston Celtics     8.0       PF  29.0
5               Amir Johnson          Boston Celtics    90.0       PF  29.0
6              Jordan Mickey          Boston Celtics    55.0       PF  21.0
7               Kelly Olynyk          Boston Celtics    41.0        C  25.0
8               Terry Rozier          Boston Celtics    12.0       PG  22.0
9               Marcus Smart          Boston Celtics    36.0       PG  22.0
10           Jared Sullinger          Boston Celtics     7.0        C  24.0
11             Isaiah Thomas          Boston Celtics     4.0       PG  27.0
12               Evan Turner          Boston Celtics    11.0       SG  27.0
13               James Young          Boston Celtics    13.0       SG  20.0
14              Tyler Zeller          Boston Celtics    44.0        C  26.0
15          Bojan Bogdanovic           Brooklyn Nets    44.0       SG  27.0
16              Markel Brown           Brooklyn Nets    22.0       SG  24.0
17           Wayne Ellington           Brooklyn Nets    21.0       SG  28.0
18   Rondae Hollis-Jefferson           Brooklyn Nets    24.0       SG  21.0
19              Jarrett Jack           Brooklyn Nets     2.0       PG  32.0
20            Sergey Karasev           Brooklyn Nets    10.0       SG  22.0
21           Sean Kilpatrick           Brooklyn Nets     6.0       SG  26.0
22              Shane Larkin           Brooklyn Nets     0.0       PG  23.0
23               Brook Lopez           Brooklyn Nets    11.0        C  28.0
24          Chris McCullough           Brooklyn Nets     1.0       PF  21.0
25               Willie Reed           Brooklyn Nets    33.0       PF  26.0
26           Thomas Robinson           Brooklyn Nets    41.0       PF  25.0
27                Henry Sims           Brooklyn Nets    14.0        C  26.0
28              Donald Sloan           Brooklyn Nets    15.0       PG  28.0
29            Thaddeus Young           Brooklyn Nets    30.0       PF  27.0
..                       ...                     ...     ...      ...   ...
428          Al-Farouq Aminu  Portland Trail Blazers     8.0       SF  25.0
429          Pat Connaughton  Portland Trail Blazers     5.0       SG  23.0
430             Allen Crabbe  Portland Trail Blazers    23.0       SG  24.0
431                 Ed Davis  Portland Trail Blazers    17.0        C  27.0
432         Maurice Harkless  Portland Trail Blazers     4.0       SF  23.0
433         Gerald Henderson  Portland Trail Blazers     9.0       SG  28.0
434              Chris Kaman  Portland Trail Blazers    35.0        C  34.0
435           Meyers Leonard  Portland Trail Blazers    11.0       PF  24.0
436           Damian Lillard  Portland Trail Blazers     0.0       PG  25.0
437            C.J. McCollum  Portland Trail Blazers     3.0       SG  24.0
438             Luis Montero  Portland Trail Blazers    44.0       SG  23.0
439            Mason Plumlee  Portland Trail Blazers    24.0        C  26.0
440            Brian Roberts  Portland Trail Blazers     2.0       PG  30.0
441              Noah Vonleh  Portland Trail Blazers    21.0       PF  20.0
442            Trevor Booker               Utah Jazz    33.0       PF  28.0
443               Trey Burke               Utah Jazz     3.0       PG  23.0
444               Alec Burks               Utah Jazz    10.0       SG  24.0
445               Dante Exum               Utah Jazz    11.0       PG  20.0
446           Derrick Favors               Utah Jazz    15.0       PF  24.0
447              Rudy Gobert               Utah Jazz    27.0        C  23.0
448           Gordon Hayward               Utah Jazz    20.0       SF  26.0
449              Rodney Hood               Utah Jazz     5.0       SG  23.0
450               Joe Ingles               Utah Jazz     2.0       SF  28.0
451            Chris Johnson               Utah Jazz    23.0       SF  26.0
452               Trey Lyles               Utah Jazz    41.0       PF  20.0
453             Shelvin Mack               Utah Jazz     8.0       PG  26.0
454                Raul Neto               Utah Jazz    25.0       PG  24.0
455             Tibor Pleiss               Utah Jazz    21.0        C  26.0
456              Jeff Withey               Utah Jazz    24.0        C  26.0
457                      NaN                     NaN     NaN      NaN   NaN

    Height  Weight            College      Salary
0      6-2   180.0              Texas   7730337.0
1      6-6   235.0          Marquette   6796117.0
2      6-5   205.0  Boston University         NaN
3      6-5   185.0      Georgia State   1148640.0
4     6-10   231.0                NaN   5000000.0
5      6-9   240.0                NaN  12000000.0
6      6-8   235.0                LSU   1170960.0
7      7-0   238.0            Gonzaga   2165160.0
8      6-2   190.0         Louisville   1824360.0
9      6-4   220.0     Oklahoma State   3431040.0
10     6-9   260.0         Ohio State   2569260.0
11     5-9   185.0         Washington   6912869.0
12     6-7   220.0         Ohio State   3425510.0
13     6-6   215.0           Kentucky   1749840.0
14     7-0   253.0     North Carolina   2616975.0
15     6-8   216.0                NaN   3425510.0
16     6-3   190.0     Oklahoma State    845059.0
17     6-4   200.0     North Carolina   1500000.0
18     6-7   220.0            Arizona   1335480.0
19     6-3   200.0       Georgia Tech   6300000.0
20     6-7   208.0                NaN   1599840.0
21     6-4   219.0         Cincinnati    134215.0
22    5-11   175.0         Miami (FL)   1500000.0
23     7-0   275.0           Stanford  19689000.0
24    6-11   200.0           Syracuse   1140240.0
25    6-10   220.0        Saint Louis    947276.0
26    6-10   237.0             Kansas    981348.0
27    6-10   248.0         Georgetown    947276.0
28     6-3   205.0          Texas A&M    947276.0
29     6-8   221.0       Georgia Tech  11235955.0
..     ...     ...                ...         ...
428    6-9   215.0        Wake Forest   8042895.0
429    6-5   206.0         Notre Dame    625093.0
430    6-6   210.0         California    947276.0
431   6-10   240.0     North Carolina   6980802.0
432    6-9   215.0         St. John's   2894059.0
433    6-5   215.0               Duke   6000000.0
434    7-0   265.0   Central Michigan   5016000.0
435    7-1   245.0           Illinois   3075880.0
436    6-3   195.0        Weber State   4236287.0
437    6-4   200.0             Lehigh   2525160.0
438    6-7   185.0     Westchester CC    525093.0
439   6-11   235.0               Duke   1415520.0
440    6-1   173.0             Dayton   2854940.0
441    6-9   240.0            Indiana   2637720.0
442    6-8   228.0            Clemson   4775000.0
443    6-1   191.0           Michigan   2658240.0
444    6-6   214.0           Colorado   9463484.0
445    6-6   190.0                NaN   3777720.0
446   6-10   265.0       Georgia Tech  12000000.0
447    7-1   245.0                NaN   1175880.0
448    6-8   226.0             Butler  15409570.0
449    6-8   206.0               Duke   1348440.0
450    6-8   226.0                NaN   2050000.0
451    6-6   206.0             Dayton    981348.0
452   6-10   234.0           Kentucky   2239800.0
453    6-3   203.0             Butler   2433333.0
454    6-1   179.0                NaN    900000.0
455    7-3   256.0                NaN   2900000.0
456    7-0   231.0             Kansas    947276.0
457    NaN     NaN                NaN         NaN

[458 rows x 9 columns]

### Creating a DataFrame from an Excel file

In [ ]:
pip install xlrd

In [31]:
import pandas as pd

df = pd.read_excel(r"Data - Single Worksheet.xlsx")
print(df)

ImportError: Install xlrd >= 1.0.0 for Excel support

## Basic Functionality of DataFrame

#### Head()

In [33]:
df = pd.read_csv(r"nba.csv")
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [34]:
df.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

#### tail()

In [35]:
df.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [40]:
import pandas as pd

lst = [['Anil', 98],['Basanti',80],['Charan',99],['Dolly',100]]

df = pd.DataFrame(lst, columns=['StudentName','Marks'], index=['Row1','Row2','Row3','Row4'])
df

     StudentName  Marks
Row1        Anil     98
Row2     Basanti     80
Row3      Charan     99
Row4       Dolly    100

#### DataFrame Transpose

In [41]:
df.T

             Row1     Row2    Row3   Row4
StudentName  Anil  Basanti  Charan  Dolly
Marks          98       80      99    100

#### index

In [42]:
df.index

Index(['Row1', 'Row2', 'Row3', 'Row4'], dtype='object')

#### columns

In [43]:
df.columns

Index(['StudentName', 'Marks'], dtype='object')

#### axes

In [44]:
df.axes

[Index(['Row1', 'Row2', 'Row3', 'Row4'], dtype='object'),
 Index(['StudentName', 'Marks'], dtype='object')]

#### values

In [45]:
df.values

array([['Anil', 98],
       ['Basanti', 80],
       ['Charan', 99],
       ['Dolly', 100]], dtype=object)

#### Shape

In [46]:
df.shape

(4, 2)

#### dtypes

In [47]:
df.dtypes

StudentName    object
Marks           int64
dtype: object

#### info

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Row1 to Row4
Data columns (total 2 columns):
StudentName    4 non-null object
Marks          4 non-null int64
dtypes: int64(1), object(1)
memory usage: 256.0+ bytes

## Select One Column from a `DataFrame`

In [60]:
import pandas as pd
data=[['Anil',90,'A','Very Good'],['Basanti',89,'A-','Good'],['Charan',70,'B-','Average'],['Dolly',40,'D+','Below_Avereage'],
      ['Emily',68,'B-','Average'],['Fani',99,'A+','Awesome'],['goutham',29,'F','Bad'],['Hannah',55,'C+','Below_Average']]
df=pd.DataFrame(data,columns=['StudentName','Marks','Grade','Remarks'],index=['R1','R2','R3','R4','R5','R6','R7','R8'])
df

   StudentName  Marks Grade         Remarks
R1        Anil     90     A       Very Good
R2     Basanti     89    A-            Good
R3      Charan     70    B-         Average
R4       Dolly     40    D+  Below_Avereage
R5       Emily     68    B-         Average
R6        Fani     99    A+         Awesome
R7     goutham     29     F             Bad
R8      Hannah     55    C+   Below_Average

In [50]:
df['StudentName']

0       Anil
1    Basanti
2     Charan
3      Dolly
4      Emily
5       Fani
6    goutham
7     Hannah
Name: StudentName, dtype: object

In [51]:
df['Grade']

0     A
1    A-
2    B-
3    D+
4    B-
5    A+
6     F
7    C+
Name: Grade, dtype: object

### Selecting multiple columns of a DataFrame

In [52]:
df[['StudentName','Grade']]

  StudentName Grade
0        Anil     A
1     Basanti    A-
2      Charan    B-
3       Dolly    D+
4       Emily    B-
5        Fani    A+
6     goutham     F
7      Hannah    C+

In [53]:
lst_colmns = ['Marks','Remarks']
df[lst_colmns]

   Marks         Remarks
0     90       Very Good
1     89            Good
2     70         Average
3     40  Below_Avereage
4     68         Average
5     99         Awesome
6     29             Bad
7     55   Below_Average

In [54]:
df[df.columns[0:3]]

  StudentName  Marks Grade
0        Anil     90     A
1     Basanti     89    A-
2      Charan     70    B-
3       Dolly     40    D+
4       Emily     68    B-
5        Fani     99    A+
6     goutham     29     F
7      Hannah     55    C+

### selecting rows in a DataFrame

#### loc()

In [64]:
df.loc['R1']

StudentName         Anil
Marks                 90
Grade                  A
Remarks        Very Good
Name: R1, dtype: object

In [65]:
df.loc[['R1','R5','R7']]

   StudentName  Marks Grade    Remarks
R1        Anil     90     A  Very Good
R5       Emily     68    B-    Average
R7     goutham     29     F        Bad

In [66]:
df.loc['R1':'R5']

   StudentName  Marks Grade         Remarks
R1        Anil     90     A       Very Good
R2     Basanti     89    A-            Good
R3      Charan     70    B-         Average
R4       Dolly     40    D+  Below_Avereage
R5       Emily     68    B-         Average

In [67]:
df.loc['R1','StudentName']

'Anil'

In [72]:
df.loc['R1':'R3', 'Marks':'Remarks']

    Marks Grade    Remarks
R1     90     A  Very Good
R2     89    A-       Good
R3     70    B-    Average

#### .iloc()

In [73]:
df.iloc[0]

StudentName         Anil
Marks                 90
Grade                  A
Remarks        Very Good
Name: R1, dtype: object

In [74]:
df.iloc[[3,7]]

   StudentName  Marks Grade         Remarks
R4       Dolly     40    D+  Below_Avereage
R8      Hannah     55    C+   Below_Average

In [78]:
df.iloc[[3,7],[0,2]]

   StudentName Grade
R4       Dolly    D+
R8      Hannah    C+

In [81]:
df.iloc[0,0]

'Anil'